{
    "title": "about",
    "slug": "about",
    "content": "<h1>About Arkham Explorer</h1>\n<p>Arkham Explorer exists to provide high-quality assets, structured data, community content, and custom tools for\n<em>Arkham Horror: The Card Game</em> by <em>Fantasy Flight Games</em>.</p>\n<p>This website can be installed onto your mobile device's home screen and accessed offline, allowing you to browse all\nassets and use its tools without needing an internet connection.</p>\n<h2>Official Content</h2>\n<p>The main feature of this website is a curated API and web app browser for content related to official\n<em>Arkham Horror: The Card Game</em> content, created and published by <em>Fantasy Flight Games</em>. This includes box art, icons\nfor expansions and encounter sets, and metadata for all released products.</p>\n<p>Much of this data is fetched from <a href=\"https://arkhamdb.com/\">ArkhamDB</a> and reformatted for better developer access, along\nwith some manually-curated info that is not provided through that API. Wherever possible, all content and metadata is\nsourced directly from Fantasy Flight Games (either their website, or extracted through its officially published PDFS).</p>\n<p>All content, both literal and graphical, is copyrighted by Fantasy Flight Games. This website is not produced, endorsed,\nsupported, or affiliated with Fantasy Flight Games.</p>\n<h2>Community Content</h2>\n<p>This website also curates links to content creators, useful resources, and other things that are commonly endorsed by\nthe Arkham Horror: LCG community. This content is currently curated on <a href=\"https://cjbrooks12.github.io/arkham-explorer/pages/resources\">this page</a>.</p>\n<h2>Custom Tools</h2>\n<p>There are some great tools produced by the community, but they are often in mobile apps, Excel docs, or other\nprograms/formats that are difficult to casually access. So I'm using my own software development skills to help the\ncommunity by recreating some of these tools directly on this website, so they can be accessed from anywhere.</p>\n<p>See the list of available tools <a href=\"https://cjbrooks12.github.io/arkham-explorer/tools\">here</a>.</p>\n<h2>Offline Access</h2>\n<p>this entire website is served to you as a\n<a href=\"https://en.wikipedia.org/wiki/Progressive_web_application\">Progressive Web App</a>, which means it can be installed onto\nyour mobile device and accessed offline. Any content that is downloaded will be cached, so that any page you've visted\nbefore will remain accessible, even without an internet connection.</p>\n<p>This is especially useful for the custom <a href=\"https://cjbrooks12.github.io/arkham-explorer/tools\">here</a>.</p>\n<p>Note that as this site's content and code is still under active development and may need to be refreshed from\ntime-to-time, so it is advisable that you preload the pages you need to access if you know you are going somewhere\nwithout internet access, to ensure those pages have the most up-to-date content and will still be available.</p>\n<h2>API</h2>\n<p>In addition to hosting a website where non-technical users can browser and download game assets, this site provides an\n<a href=\"https://cjbrooks12.github.io/arkham-explorer/pages/api\">API</a> to allow programs to dynamically fetch this data. In fact, this entire site is served to\nyou as a <a href=\"https://en.wikipedia.org/wiki/Progressive_web_application\">Progressive Web App</a>, using these same APIs for\nitself. This means anything you see on this website can also be included in your application.</p>\n<p>See more about how to interact with the API <a href=\"https://cjbrooks12.github.io/arkham-explorer/pages/api\">here</a>, and Swagger documentation for the API can be\nfound <a href=\"https://cjbrooks12.github.io/arkham-explorer/api/doc/\">here</a>.</p>\n"
}