{
    "title": "api",
    "slug": "api",
    "content": "<h1>Arkham Explorer API</h1>\n<p>One of the biggest motivations to create this site was to provide the Arkham Horror LCG community with a centralized``\nlocation for game data and assets. Typically, one owuld have to scour through forums on BoardGameGeek, Reddit, or\nthe Mythos Busters Discord server to find the assets they're looking for, and even then they're typically not in a\nformat that is suitable for programming applications.</p>\n<p>Arkham Explorer offers a fully-documented API to enable programmers and software developers to fetch and display data\nfor their applications, without needing to gather and format all that info themselves.</p>\n<p>The API can be accessed at the base URL of <code>https://cjbrooks12.github.io/arkham-explorer/api</code>, and Swagger documentation can be found\n<a href=\"https://cjbrooks12.github.io/arkham-explorer/api/doc/\">here</a>.</p>\n<p>All data offered through the API can be used free-of-charge with no restrictions on usage limits. However, the site is\nbeing generously served for free as static JSON files and other assets via\n<a href=\"https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages\">GitHub Pages</a>, but it has soft\nlimits on monthly bandwidth and potential rate-limits if you are not careful with how you access the API. Please cache\nall content fetched from this API to ensure it will always be available to all developers and users of your application.</p>\n<p>Additionally, since the content may be updated over time, it is advisable to fetch these assets at runtime from your\napplication when possible, rather than downloading and hardcoding them in your app's source code. This will ensure your\napp always has the most up-to-date data available, frees you from the burden to managing those assets yourself, and will\nhelp make Arkham Explorer remain the central location on the for this data.</p>\n<p>All information and assets provided by this API is copyrighted by Fantasy Flight Games. This website and API is not\nproduced, endorsed, supported, or affiliated with Fantasy Flight Games. Additionally, some content has been taken from\nthe <a href=\"https://arkhamdb.com/api/\">ArkhamDB API</a>, and reformatted to be more easily discoverable and fix some issues\nwith the formatting of data presented by that API.</p>\n"
}